<a href="https://colab.research.google.com/github/engineer-nicolas/cs50sql/blob/master/lecture_0_Querying/lecture_0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lecture 0 - Querying - CS50 SQL harvard

Let's install this Python library to be able to execute SQLite code directly inside Jupyter Notebook cells using SQL syntax

In [1]:
#%conda install mamba

In [2]:
#%mamba install pandas

In [3]:
# Let's import the required libraries
import sqlite3
import pandas as pd
import os

In [4]:
longlist_db_string_format="""
BEGIN TRANSACTION;
CREATE TABLE "longlist" (
    "isbn" TEXT,
    "title" TEXT,
    "author" TEXT,
    "translator" TEXT,
    "format" TEXT,
    "pages" INTEGER,
    "publisher" TEXT,
    "published" TEXT,
    "year" INTEGER,
    "votes" INTEGER,
    "rating" REAL
);
INSERT INTO "longlist" VALUES('9788439736967','Boulder','Eva Baltasar','Nicole d''Amonville Alegría','paperback',112,'Literatura Random House','2022-08-02',2023,2779,3.77);
INSERT INTO "longlist" VALUES('9781628971538','Whale','Cheon Myeong-Kwan','Jae Won Chung','paperback',368,'Europa Editions','2023-01-19',2023,175,3.97);
INSERT INTO "longlist" VALUES('9781642861181','The Gospel According to the New World','Maryse Condé','Richard Philcox','paperback',184,'World Editions','2023-03-07',2023,114,3.05);
INSERT INTO "longlist" VALUES('9781529414431','Standing Heavy','Gauz','Frank Wynne','paperback',252,'MacLehose Press','2022-05-26',2023,322,3.57);
INSERT INTO "longlist" VALUES('9781474623025','Time Shelter','Georgi Gospodinov','Angela Rodel','hardcover',304,'W&N','2022-04-21',2023,3142,4.05);
INSERT INTO "longlist" VALUES('9781839764318','Is Mother Dead','Vigdis Hjorth','Charlotte Barslund','paperback',330,'Verso Fiction','2022-09-27',2023,2455,3.76);
INSERT INTO "longlist" VALUES('9781529427820','Jimi Hendrix Live in Lviv','Andrey Kurkov','Reuben Woolley','hardcover',416,'MacLehose Press','2023-04-27',2023,167,3.64);
INSERT INTO "longlist" VALUES('9781945492655','The Birthday Party','Laurent Mauvignier','Daniel Levin Becker','paperback',454,'Transit Books','2023-01-24',2023,529,3.83);
INSERT INTO "longlist" VALUES('9781804270288','While We Were Dreaming','Clemens Meyer','Katy Derbyshire','paperback',528,'Fitzcarraldo Editions','2023-03-30',2023,705,4.0);
INSERT INTO "longlist" VALUES('9781782278627','Pyre','Perumal Murugan','Aniruddhan Vasudevan','paperback',224,'Pushkin Press','2022-04-08',2023,1302,4.04);
INSERT INTO "longlist" VALUES('9781913097660','Still Born','Guadalupe Nettel','Rosalind Harvey','paperback',200,'Fitzcarraldo Editions','2022-06-22',2023,7647,4.14);
INSERT INTO "longlist" VALUES('9781914484872','A System So Magnificent It Is Blinding','Amanda Svensson','Nichola Smalley','paperback',544,'Scribe UK','2023-03-09',2023,1401,3.62);
INSERT INTO "longlist" VALUES('9781739822507','Ninth Building','Zou Jingzhi','Jeremy Tiang','paperback',272,'Honford Star','2022-05-16',2023,40,3.78);
INSERT INTO "longlist" VALUES('9781913097875','Paradais','Fernanda Melchor','Sophie Hughes','paperback',118,'Fitzcarraldo Editions','2022-03-23',2022,8109,3.71);
INSERT INTO "longlist" VALUES('9781509898251','Heaven','Mieko Kawakami','Sam Bett and David Boyd','paperback',167,'Picador','2022-05-12',2022,26217,3.83);
INSERT INTO "longlist" VALUES('9781911284659','Love in the Big City','Sang Young Park','Anton Hur','paperback',217,'Tilted Axis Press','2021-10-29',2022,5156,3.69);
INSERT INTO "longlist" VALUES('9781911284635','Happy Stories, Mostly','Norman Erikson Pasaribu','Tiffany Tsao','paperback',151,'Tilted Axis Press','2021-12-02',2022,872,3.8);
INSERT INTO "longlist" VALUES('9781999368432','Elena Knows','Claudia Piñeiro','Frances Riddle','paperback',143,'Charco Press','2021-07-01',2022,8212,4.1);
INSERT INTO "longlist" VALUES('9781982108786','The Book of Mother','Violaine Huisman','Leslie Camhi','paperback',224,'Scribner','2021-09-19',2022,1726,3.79);
INSERT INTO "longlist" VALUES('9781787332935','More Than I Love My Life','David Grossman','Jessica Cohen','paperback',288,'Jonathan Cape','2021-08-26',2022,3705,4.05);
INSERT INTO "longlist" VALUES('9781913505189','Phenotypes','Paulo Scott','Daniel Hahn','paperback',232,'And Other Stories','2022-01-01',2022,839,3.84);
INSERT INTO "longlist" VALUES('9781913097721','A New Name: Septology VI-VII','Jon Fosse','Damion Searls','paperback',228,'Fitzcarraldo Editions','2021-09-08',2022,479,4.5);
INSERT INTO "longlist" VALUES('9781999992859','After the Sun','Jonas Eika','Sherilyn Nicolette Hellberg','paperback',158,'Lolli Editions','2021-08-24',2022,1684,3.25);
INSERT INTO "longlist" VALUES('9781911284611','Tomb of Sand','Geentanjali Shree','Daisy Rockwell','paperback',739,'Tilted Axis Press','2021-08-12',2022,1823,3.8);
INSERT INTO "longlist" VALUES('9781910695593','The Books of Jacob','Olga Tokarczuk','Jennifer Croft','paperback',920,'Fitzcarraldo Editions','2021-11-15',2022,5664,4.06);
INSERT INTO "longlist" VALUES('9781916277182','Cursed Bunny','Bora Chung','Anton Hur','paperback',251,'Honford Star','2021-06-15',2022,10039,3.88);
INSERT INTO "longlist" VALUES('9781529038538','The War of the Poor','Éric Vuillard','Mark Polizzotti','hardcover',69,'Picador','2021-01-07',2021,2096,3.36);
INSERT INTO "longlist" VALUES('9781782276128','When We Cease to Understand the World','Benajamín Labatut','Adrian Nathan West','hardcover',192,'Pushkin Press','2020-09-03',2021,23251,4.14);
INSERT INTO "longlist" VALUES('9781911508762','Wretchedness','Andrzej Tichy','Nichola Smalley','paperback',176,'And Other Stories','2020-06-02',2021,308,3.45);
INSERT INTO "longlist" VALUES('9781529400793','An Inventory of Losses','Judith Schalansky','Jackie Smith','hardcover',256,'MacLehose Press','2020-08-20',2021,1329,3.36);
INSERT INTO "longlist" VALUES('9781782275862','At Night All Blood is Black','David Diop','Anna Moschovakis','hardcover',192,'Pushkin Press','2020-11-05',2021,18032,3.84);
INSERT INTO "longlist" VALUES('9780300247435','I Live in the Slums','Can Xue','Karen Gernant and Chen Zeping','hardcover',344,'Yale University Press','2020-05-19',2021,95,3.29);
INSERT INTO "longlist" VALUES('9781913097530','In Memory of Memory','Maria Stepanova','Sasha Dugdale','paperback',510,'Fitzcarraldo Editions','2021-02-17',2021,1554,3.87);
INSERT INTO "longlist" VALUES('9781913097172','Minor Detail','Adania Shibli','Elisabeth Jaquette','paperback',144,'Fitzcarraldo Editions','2020-05-06',2021,3948,3.97);
INSERT INTO "longlist" VALUES('9781912987139','Summer Brother','Jaap Robben','David Doherty','paperback',285,'World Editions','2021-04-08',2021,2265,3.72);
INSERT INTO "longlist" VALUES('9781783786718','The Dangers of Smoking in Bed','Mariana Enríquez','Megan McDowell','paperback',187,'Granta Books','2021-04-01',2021,25161,3.85);
INSERT INTO "longlist" VALUES('9781999992880','The Employees','Olga Ravn','Martin Aitken','paperback',136,'Lolli Editions','2020-10-01',2021,7357,3.72);
INSERT INTO "longlist" VALUES('9781908670601','The Pear Field','Nana Ekvtimishvili','Elizabeth Heighway','paperback',163,'Peirene Press','2020-10-30',2021,1077,3.7);
INSERT INTO "longlist" VALUES('9781620975251','The Perfect Nine','Ngũgĩ wa Thiong''o',NULL,'hardcover',240,'The New Press','2020-10-06',2021,956,3.72);
INSERT INTO "longlist" VALUES('9781916465664','The Adventures of China Iron','Gabriela Cabezón Cámara','Fiona Mackintosh and Iona Macintyre','paperback',200,'Charco Press','2019-11-14',2020,3412,3.86);
INSERT INTO "longlist" VALUES('9780571349364','The Discomfort of Evening','Marieke Lucas Rijneveld','Michele Hutchinson','paperback',282,'Faber & Faber','2020-03-05',2020,27310,3.47);
INSERT INTO "longlist" VALUES('9781911617464','The Eighth Life','Nino Haratischvili','Charlotte Collins and Ruth Martin','hardcover',944,'Scribe UK','2019-11-14',2020,16350,4.52);
INSERT INTO "longlist" VALUES('9781609455651','The Enlightenment of The Greengage Tree','Shokoofeh Azar',NULL,'paperback',256,'Europa Editions','2020-01-17',2020,3777,3.8);
INSERT INTO "longlist" VALUES('9781787300750','The Memory Police','Yōko Ogawa','Stephen Snyder','paperback',277,'Harvill Secker','2019-08-15',2020,67938,3.74);
INSERT INTO "longlist" VALUES('9781910695913','The Other Name: Septology I-II','Jon Fosse','Damion Searls','paperback',351,'Fitzcarraldo Editions','2019-10-10',2020,1245,4.19);
INSERT INTO "longlist" VALUES('9781529403657','Tyll','Daniel Kehlmann','Ross Benjamin','hardcover',352,'Riverrun','2020-02-06',2020,10839,3.95);
INSERT INTO "longlist" VALUES('9781908670557','Faces on the Tip of My Tongue','Emmanuelle Pagano','Sophie Lewis and Jennifer Higgins','paperback',136,'Peirene Press','2019-10-22',2020,222,3.57);
INSERT INTO "longlist" VALUES('9781913097097','Hurricane Season','Fernanda Melchor','Sophie Hughes','paperback',229,'Fitzcarraldo Editions','2020-02-19',2020,22551,4.08);
INSERT INTO "longlist" VALUES('9781786077929','Little Eyes','Samanta Schweblin','Megan McDowell','hardcover',256,'Oneworld','2020-04-16',2020,16462,3.61);
INSERT INTO "longlist" VALUES('9781787300453','Mac and His Problem','Enrique Vila-Matas','Margaret Jull Costa and Sophie Hughes','paperback',224,'Harvill Secker','2019-06-06',2020,606,3.48);
INSERT INTO "longlist" VALUES('9781782274223','Red Dog','Willem Anker','Michiel Heyns','hardcover',432,'Pushkin Press','2019-06-06',2020,198,3.42);
INSERT INTO "longlist" VALUES('9781785152238','Serotonin','Michel Houellebecq','Shaun Whiteside','hardcover',320,'William Heinemann','2019-09-26',2020,23852,3.58);
INSERT INTO "longlist" VALUES('9781911617235','At Dusk','Hwang Sok-yong','Sora Kim-Russell','paperback',192,'Scribe UK','2018-11-19',2019,1402,3.7);
INSERT INTO "longlist" VALUES('9781912240166','Celestial Bodies','Jokha Alharthi','Marilyn Booth','paperback',243,'Sandstone Press','2018-05-21',2019,13710,3.42);
INSERT INTO "longlist" VALUES('9781910695715','Drive Your Plow Over the Bones of the Dead','Olga Tokarczuk','Antonia Lloyd-Jones','paperback',270,'Fitzcarraldo Editions','2019-01-01',2019,80110,3.96);
INSERT INTO "longlist" VALUES('9781846276507','Four Soldiers','Hubert Mingarelli','Sam Taylor','hardcover',160,'Portobello Books','2018-10-04',2019,623,3.83);
INSERT INTO "longlist" VALUES('9781846276675','Jokes for the Gunmen','Mazen Maarouf','Jonathan Wright','paperback',162,'Portobello Books','2019-01-03',2019,503,3.42);
INSERT INTO "longlist" VALUES('9780300224313','Love in the New Millennium','Can Xue','Eileen Myles and Annelise Finegan Wasmoen','hardcover',288,'Yale University Press','2018-11-20',2019,266,3.17);
INSERT INTO "longlist" VALUES('9781786074560','Mouthful of Birds','Samanta Schweblin','Megan McDowell','paperback',228,'Oneworld','2019-02-07',2019,10576,3.75);
INSERT INTO "longlist" VALUES('9781911344889','The Death of Murat Idrissi','Tommy Wieringa','Sam Garrett','hardcover',112,'Scribe UK','2019-01-10',2019,2053,3.36);
INSERT INTO "longlist" VALUES('9780857054722','The Faculty of Dreams','Sara Stridsberg','Deborah Bragan-Turner','paperback',338,'MacLehose Press','2019-03-21',2019,2914,3.92);
INSERT INTO "longlist" VALUES('9781788160919','The Pine Islands','Marion Poschmann','Jen Calleja','hardcover',180,'Serpent''s Tail','2019-03-21',2019,1738,3.16);
INSERT INTO "longlist" VALUES('9781911508328','The Remainder','Alia Trabucco Zerán','Sophie Hughes','paperback',193,'And Other Stories','2018-10-04',2019,1012,3.52);
INSERT INTO "longlist" VALUES('9780857056580','The Shape of the Ruins','Juan Gabriel Vásquez','Anne McLean','hardcover',512,'MacLehose Press','2018-05-03',2019,2466,3.95);
INSERT INTO "longlist" VALUES('9781910695784','The Years','Annie Ernaux','Alison L. Strayer','paperback',232,'Fitzcarraldo Editions','2018-06-20',2019,16888,4.18);
INSERT INTO "longlist" VALUES('9781786070609','Frankenstein in Baghdad','Ahmed Saadawi','Jonathan Wright','paperback',272,'Oneworld','2018-02-01',2018,14760,3.57);
INSERT INTO "longlist" VALUES('9781846276200','Go, Went, Gone','Jenny Erpenbeck','Susan Bernofsky','hardcover',368,'Portobello Books','2017-08-07',2018,7736,3.97);
INSERT INTO "longlist" VALUES('9781781258934','Like a Fading Shadow','Antonio Muñoz Molina','Camilo A. Ramirez','hardcover',320,'Tuskar Rock','2017-11-02',2018,592,3.56);
INSERT INTO "longlist" VALUES('9781910701584','The 7th Function of Language','Laurent Binet','Sam Taylor','hardcover',390,'Harvill Secker','2017-05-03',2018,5638,3.76);
INSERT INTO "longlist" VALUES('9781910701980','The Dinner Guest','Gabriela Ybarra','Natasha Wimmer','paperback',160,'Harvill Secker','2018-03-01',2018,893,3.41);
INSERT INTO "longlist" VALUES('9780857424747','The Flying Mountain','Christoph Ransmayr','Simon Pare','hardcover',336,'Seagull Books','2018-03-31',2018,323,4.1);
INSERT INTO "longlist" VALUES('9780857056504','The Impostor','Javier Cercas','Frank Wynne','hardcover',430,'MacLehose Press','2017-11-02',2018,2139,3.64);
INSERT INTO "longlist" VALUES('9781925498554','The Stolen Bicycle','Wu Ming-Yi','Darryl Sterk','paperback',416,'Text Publishing','2017-08-28',2018,1467,3.88);
INSERT INTO "longlist" VALUES('9780525573067','The White Book','Han Kang','Deborah Smith','paperback',161,'Portobello Books','2018-04-05',2018,14052,3.83);
INSERT INTO "longlist" VALUES('9781788160124','The World Goes On','László Krasznahorkai','Ottilie Mulzet, George Szirtes, and John Batki','paperback',320,'Tuskar Rock','2018-05-31',2018,772,3.77);
INSERT INTO "longlist" VALUES('9780857055422','Vernon Subutex 1','Virginie Despentes','Frank Wynne','paperback',352,'MacLehose Press','2018-03-22',2018,12250,3.89);
INSERT INTO "longlist" VALUES('9781999722784','Die, My Love','Ariana Harwicz','Sarah Moses and Carolina Orloff','paperback',123,'Charco Press','2017-09-14',2018,4567,3.53);
INSERT INTO "longlist" VALUES('9781910695432','Flights','Olga Tokarczuk','Jennifer Croft','paperback',410,'Fitzcarraldo Editions','2017-05-17',2018,27229,3.76);
COMMIT;
"""

In [5]:
# Let's connect to the SQLite database used in CS50
conn = sqlite3.connect("longlist.db")
conn.executescript(longlist_db_string_format)
conn.commit()

In [6]:
file="longlist.db"
size_bytes = os.path.getsize(file)
print(f"Database {file} size: {size_bytes / (1024**2):.2f} MB")

Database longlist.db size: 0.02 MB

In [7]:
# Let's inspect the schema of the longlist table
pd.read_sql_query(
    "PRAGMA table_info(longlist);",
    conn
)

    cid        name     type  notnull dflt_value  pk
0     0        isbn     TEXT        0       None   0
1     1       title     TEXT        0       None   0
2     2      author     TEXT        0       None   0
3     3  translator     TEXT        0       None   0
4     4      format     TEXT        0       None   0
5     5       pages  INTEGER        0       None   0
6     6   publisher     TEXT        0       None   0
7     7   published     TEXT        0       None   0
8     8        year  INTEGER        0       None   0
9     9       votes  INTEGER        0       None   0
10   10      rating     REAL        0       None   0

#### SELECT + DISTINCT

SELECT allows us to select some or all columns and rows from a table inside the database.

It is good practice to use double quotes around table and column names, which are called SQL identifiers. SQL also has strings and we use single quotes around strings to differentiate them from identifiers.

In [8]:
# Selects all columns from "longlist" table
pd.read_sql_query(
"SELECT * FROM longlist;",
conn
)

,isbn,title,author,translator,format,pages,publisher,published,year,votes,rating
0,9788439736967,Boulder,Eva Baltasar,Nicole d'Amonville Alegría,paperback,112,Literatura Random House,2022-08-02,2023,2779,3.77
1,9781628971538,Whale,Cheon Myeong-Kwan,Jae Won Chung,paperback,368,Europa Editions,2023-01-19,2023,175,3.97
2,9781642861181,The Gospel According to the New World,Maryse Condé,Richard Philcox,paperback,184,World Editions,2023-03-07,2023,114,3.05
3,9781529414431,Standing Heavy,Gauz,Frank Wynne,paperback,252,MacLehose Press,2022-05-26,2023,322,3.57
4,9781474623025,Time Shelter,Georgi Gospodinov,Angela Rodel,hardcover,304,W&N,2022-04-21,2023,3142,4.05
...,...,...,...,...,...,...,...,...,...,...,...
73,9780525573067,The White Book,Han Kang,Deborah Smith,paperback,161,Portobello Books,2018-04-05,2018,14052,3.83
74,9781788160124,The World Goes On,László Krasznahorkai,"Ottilie Mulzet, George Szirtes, and John Batki",paperback,320,Tuskar Rock,2018-05-31,2018,772,3.77
75,9780857055422,Vernon Subutex 1,Virginie Despentes,Frank Wynne,paperback,352,MacLehose Press,2018-03-22,2018,12250,3.89
76,9781999722784,"Die, My Love",Ariana Harwicz,Sarah Moses and Carolina Orloff,paperback,123,Charco Press,2017-09-14,2018,4567,3.53
77,9781910695432,Flights,Olga Tokarczuk,Jennifer Croft,paperback,410,Fitzcarraldo Editions,2017-05-17,2018,27229,3.76

In [9]:
#Selects "title" and "author" column from "longlist" table
pd.read_sql_query(
"""
SELECT "title", "author" FROM "longlist";
""",
conn
)

                                    title                author
0                                 Boulder          Eva Baltasar
1                                   Whale     Cheon Myeong-Kwan
2   The Gospel According to the New World          Maryse Condé
3                          Standing Heavy                  Gauz
4                            Time Shelter     Georgi Gospodinov
..                                    ...                   ...
73                         The White Book              Han Kang
74                      The World Goes On  László Krasznahorkai
75                       Vernon Subutex 1    Virginie Despentes
76                           Die, My Love        Ariana Harwicz
77                                Flights        Olga Tokarczuk

[78 rows x 2 columns]

DISTINCT removes duplicate rows and returns only unique values

In [10]:
#Selects only DISTINCT years in "year" column from "longlist" table
pd.read_sql_query(
"""
SELECT DISTINCT "year" FROM "longlist";
""",
conn
)

   year
0  2023
1  2022
2  2021
3  2020
4  2019
5  2018

#### LIMIT

In [11]:
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
LIMIT 4;
""",
conn
)

                                   title
0                                Boulder
1                                  Whale
2  The Gospel According to the New World
3                         Standing Heavy

#### WHERE - Filtering rows with WHERE

WHERE is used to select rows based on a condition; it will output the rows for which the specified condition is true.

Conditions:

- = : equal to
- <> : not equal to

In [12]:
#Selects all books by Fernanda Melchor
pd.read_sql_query(
"""
SELECT "title","author","year"
FROM "longlist"
WHERE "author" = 'Fernanda Melchor';
""",
conn
)

              title            author  year
0          Paradais  Fernanda Melchor  2022
1  Hurricane Season  Fernanda Melchor  2020

In [13]:
#Selects all authors nominated in 2023
pd.read_sql_query(
"""
SELECT "author","year"
FROM "longlist"
WHERE "year" = 2023;

""",
conn
)

                author  year
0         Eva Baltasar  2023
1    Cheon Myeong-Kwan  2023
2         Maryse Condé  2023
3                 Gauz  2023
4    Georgi Gospodinov  2023
5        Vigdis Hjorth  2023
6        Andrey Kurkov  2023
7   Laurent Mauvignier  2023
8        Clemens Meyer  2023
9      Perumal Murugan  2023
10    Guadalupe Nettel  2023
11     Amanda Svensson  2023
12         Zou Jingzhi  2023

Note that 'paperback' is in single quotes because it is an SQL string and not an identifier.

In [14]:
pd.read_sql_query(
"""
SELECT "title", "format", "year"
FROM "longlist"
WHERE "format" <> 'paperback';

""",
conn
)

                                    title     format  year
0                            Time Shelter  hardcover  2023
1               Jimi Hendrix Live in Lviv  hardcover  2023
2                     The War of the Poor  hardcover  2021
3   When We Cease to Understand the World  hardcover  2021
4                  An Inventory of Losses  hardcover  2021
5             At Night All Blood is Black  hardcover  2021
6                     I Live in the Slums  hardcover  2021
7                        The Perfect Nine  hardcover  2021
8                         The Eighth Life  hardcover  2020
9                                    Tyll  hardcover  2020
10                            Little Eyes  hardcover  2020
11                                Red Dog  hardcover  2020
12                              Serotonin  hardcover  2020
13                          Four Soldiers  hardcover  2019
14             Love in the New Millennium  hardcover  2019
15             The Death of Murat Idrissi  hardcover  2019
16                       The Pine Islands  hardcover  2019
17                 The Shape of the Ruins  hardcover  2019
18                         Go, Went, Gone  hardcover  2018
19                   Like a Fading Shadow  hardcover  2018
20           The 7th Function of Language  hardcover  2018
21                    The Flying Mountain  hardcover  2018
22                           The Impostor  hardcover  2018

#### WHERE + NOT, AND, OR - Compound conditions

In [15]:
pd.read_sql_query(
"""
SELECT "title", "format", "year"
FROM "longlist"
WHERE ("year" = 2022 OR "year" = 2023) AND NOT "format" = 'paperback';
""",
conn
)

                       title     format  year
0               Time Shelter  hardcover  2023
1  Jimi Hendrix Live in Lviv  hardcover  2023

#### WHERE + Ranges conditions (>,>=,<,<=, BETWEEN __ AND __) - Filtering numbers

In [16]:
#Find all books between 2022 and 2023 with a range condition
pd.read_sql_query(
"""
SELECT "title", "year"
FROM "longlist"
WHERE "year" >= 2022 AND "year" <= 2023;
""",
conn
)

                                     title  year
0                                  Boulder  2023
1                                    Whale  2023
2    The Gospel According to the New World  2023
3                           Standing Heavy  2023
4                             Time Shelter  2023
5                           Is Mother Dead  2023
6                Jimi Hendrix Live in Lviv  2023
7                       The Birthday Party  2023
8                   While We Were Dreaming  2023
9                                     Pyre  2023
10                              Still Born  2023
11  A System So Magnificent It Is Blinding  2023
12                          Ninth Building  2023
13                                Paradais  2022
14                                  Heaven  2022
15                    Love in the Big City  2022
16                   Happy Stories, Mostly  2022
17                             Elena Knows  2022
18                      The Book of Mother  2022
19                More Than I Love My Life  2022
20                              Phenotypes  2022
21            A New Name: Septology VI-VII  2022
22                           After the Sun  2022
23                            Tomb of Sand  2022
24                      The Books of Jacob  2022
25                            Cursed Bunny  2022

In [17]:
#Find all books between 2022 and 2023 with BETWEEN
pd.read_sql_query(
"""
SELECT "title", "year"
FROM "longlist"
WHERE "year" BETWEEN 2022 AND 2023;
""",
conn
)

                                     title  year
0                                  Boulder  2023
1                                    Whale  2023
2    The Gospel According to the New World  2023
3                           Standing Heavy  2023
4                             Time Shelter  2023
5                           Is Mother Dead  2023
6                Jimi Hendrix Live in Lviv  2023
7                       The Birthday Party  2023
8                   While We Were Dreaming  2023
9                                     Pyre  2023
10                              Still Born  2023
11  A System So Magnificent It Is Blinding  2023
12                          Ninth Building  2023
13                                Paradais  2022
14                                  Heaven  2022
15                    Love in the Big City  2022
16                   Happy Stories, Mostly  2022
17                             Elena Knows  2022
18                      The Book of Mother  2022
19                More Than I Love My Life  2022
20                              Phenotypes  2022
21            A New Name: Septology VI-VII  2022
22                           After the Sun  2022
23                            Tomb of Sand  2022
24                      The Books of Jacob  2022
25                            Cursed Bunny  2022

In [18]:
#Find all books with a rating above 4.08 and at least 10 000 votes
pd.read_sql_query(
"""
SELECT "title", "year","votes","rating"
FROM "longlist"
WHERE "rating" >= 4.08 AND "votes"> 10000;
""",
conn
)

                                   title  year  votes  rating
0  When We Cease to Understand the World  2021  23251    4.14
1                        The Eighth Life  2020  16350    4.52
2                       Hurricane Season  2020  22551    4.08
3                              The Years  2019  16888    4.18

#### WHERE + IS NULL / IS NOT NULL - Missing data

It is possible that tables may have missing data. NULL is a type used to indicate that certain data does not have a value, or does not exist in the table.

In [19]:
pd.read_sql_query(
"""
SELECT "title", "year"
FROM "longlist"
WHERE "translator" IS NULL;
""",
conn
)

                                     title  year
0                         The Perfect Nine  2021
1  The Enlightenment of The Greengage Tree  2020

In [20]:
pd.read_sql_query(
"""
SELECT "title", "year"
FROM "longlist"
WHERE "translator" IS NOT NULL;
""",
conn
)

                                    title  year
0                                 Boulder  2023
1                                   Whale  2023
2   The Gospel According to the New World  2023
3                          Standing Heavy  2023
4                            Time Shelter  2023
..                                    ...   ...
71                         The White Book  2018
72                      The World Goes On  2018
73                       Vernon Subutex 1  2018
74                           Die, My Love  2018
75                                Flights  2018

[76 rows x 2 columns]

#### WHERE + LIKE - Filtering text

This keyword is used to select data that roughly matches the specified string.

LIKE is combined with the operators % (matches any characters around a given string) and _ (matches a single character).

In [21]:
#Selects titles that contain “love”
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title" LIKE '%love%';
""",
conn
)

                        title
0        Love in the Big City
1    More Than I Love My Life
2  Love in the New Millennium
3                Die, My Love

% matches 0 or more characters, so this query would match book titles that have 0 or more characters before and after “love” — that is, titles that contain “love”.

In [22]:
#Finds all books that begin with "A" (includes "A New","An","After", etc.)
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title" LIKE 'A%';
""",
conn
)

                                    title
0  A System So Magnificent It Is Blinding
1            A New Name: Septology VI-VII
2                           After the Sun
3                  An Inventory of Losses
4             At Night All Blood is Black
5                                 At Dusk

In [23]:
#Finds all books that begin with "A_" (excludes "A System...", etc.)
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title" LIKE 'A_ %';
""",
conn
)

                         title
0       An Inventory of Losses
1  At Night All Blood is Black
2                      At Dusk

In [24]:
#Finds all books that begin with "A_" and have 2 letters (excludes "At D...", etc.)
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title" LIKE 'A_';
""",
conn
)

Empty DataFrame
Columns: [title]
Index: []

Is the comparison of strings case-sensitive in SQL?

- In SQLite, comparison of strings with LIKE is by default case-insensitive, whereas comparison of strings with = is case-sensitive. (Note that, in other DBMS’s, the configuration of your database can change this!)

In [25]:
#Compare the results using LIKE and =
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title" LIKE 'pyre';
""",
conn
)

  title
0  Pyre

In [26]:
#Compare the results using LIKE and =
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
WHERE "title"='pyre';
""",
conn
)

Empty DataFrame
Columns: [title]
Index: []

#### ORDER BY + DESC, ASC

- ORDER BY chooses ascending order by default for numbers. We can also sort text alphabetically,
- We use of the SQL keyword DESC to specify the descending order and ASC can be used to explicitly specify ascending order.
- We can include a second condition as a tie-break and so on.

In [27]:
# First 4 books ordered alphabetically
pd.read_sql_query(
"""
SELECT "title"
FROM "longlist"
ORDER BY "title"
LIMIT 4;
""",
conn
)

                                    title
0            A New Name: Septology VI-VII
1  A System So Magnificent It Is Blinding
2                           After the Sun
3                  An Inventory of Losses

In [28]:
# TBottom 3 books
pd.read_sql_query(
"""
SELECT "title", "rating", "year"
FROM "longlist"
ORDER BY "rating" LIMIT 3;
""",
conn
)

                                   title  rating  year
0  The Gospel According to the New World    3.05  2023
1                       The Pine Islands    3.16  2019
2             Love in the New Millennium    3.17  2019

In [29]:
pd.read_sql_query(
"""
SELECT "title", "rating", "votes", "year"
FROM "longlist"
WHERE "rating" BETWEEN 4.10 AND 4.14
ORDER BY "rating" DESC, "votes" DESC;
""",
conn
)

                                   title  rating  votes  year
0  When We Cease to Understand the World    4.14  23251  2021
1                             Still Born    4.14   7647  2023
2                            Elena Knows    4.10   8212  2022
3                    The Flying Mountain    4.10    323  2018

In [30]:
pd.read_sql_query(
"""
SELECT "title", "rating", "votes", "year"
FROM "longlist"
WHERE "rating" BETWEEN 4.10 AND 4.14
ORDER BY "rating" DESC, "votes";
""",
conn
)

                                   title  rating  votes  year
0                             Still Born    4.14   7647  2023
1  When We Cease to Understand the World    4.14  23251  2021
2                    The Flying Mountain    4.10    323  2018
3                            Elena Knows    4.10   8212  2022

#### AVG, MIN, MAX, and SUM - Aggregate Functions

COUNT, AVG, MIN, MAX, and SUM are called aggregate functions and allow us to perform the corresponding operations over multiple rows of data.

Each of the following aggregate functions will return ONLY a SINGLE output—the aggregated value.

In [31]:
pd.read_sql_query(
"""
SELECT MIN("rating"),AVG("rating"),MAX("rating"),SUM("votes")
FROM "longlist";
""",
conn
)

   MIN("rating")  AVG("rating")  MAX("rating")  SUM("votes")
0           3.05       3.753718           4.52        604173

Would using MAX with the title column give you the longest book title?

- No, using MAX with the title column would give you the “largest” (or in this case, last) title alphabetically. Similarly, MIN will give the first title alphabetically.

##### ROUND - Rounds the result

To round the average rating to 2 decimal points

In [32]:
pd.read_sql_query(
    """
    SELECT ROUND(AVG("rating"), 2)
    FROM "longlist";
    """,
    conn
)

   ROUND(AVG("rating"), 2)
0                     3.75

##### AS - Renames column with AS

To rename the column in which the results are displayed

In [33]:
pd.read_sql_query(
    """
    SELECT ROUND(AVG("rating"), 2) AS "Average Rating"
    FROM "longlist";
    """,
    conn
)

   Average Rating
0            3.75

#### COUNT (does not count NULL values and may include duplicates) - Aggregate Functions

If we want to count every row in the database, we use the * .

In [34]:
pd.read_sql_query(
    """
    SELECT COUNT(*)
    FROM "longlist";
    """,
    conn
)

   COUNT(*)
0        78

We observe that the number of translators is fewer than the number of rows in the database. This is because the COUNT function does not count NULL values.

In [35]:
pd.read_sql_query(
    """
    SELECT COUNT("translator")
    FROM "longlist";
    """,
    conn
)

   COUNT("translator")
0                   76

DISTINCT can be used to ensure that only distinct values are counted

In [36]:
pd.read_sql_query(
    """
    SELECT COUNT(DISTINCT "publisher")
    FROM "longlist";
    """,
    conn
)

   COUNT(DISTINCT "publisher")
0                           33

In [37]:
conn.close()